{
  "recipes": [
    {
      "country": "Indian",
      "data": {
        "meals": [
          {
            "name": "Breakfast",
            "data": [
              {
                "name": "Rice Dose",
                "items": ["raw rice", "urad dal", "parboiled rice"],
                "waysToPrepare": [
                  "Allow the rice and dal and other ingredients to soak for at least 8 hours or overnight.",
                  " I usually soak them in the morning, blend up the dosa batter in the evening, and leave it to ferment overnight so I can make fresh dosas next morning.",
                  " Some traditionalists soak the rice and dal seperately, grind them separately, and then mix them. ",
                  "To me that just adds unnecessary steps and I prefer to just soak everything together and pay closer attention when I blend so I get the texture right.",
                  " Rice takes just a little longer to blend than the dal, which is perfect because you want the dal to blend smoothly while the rice remains very slightly gritty.",
                  " That helps the dosas turn out crispy. Always drain out the water you soaked the rice and dal in and add fresh, preferably filtered water when you blend the batter."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Dose" }]
              },
              {
                "name": "Rice Idli",
                "items": ["urad dal", "idli rice", "thick poha", "water"],
                "waysToPrepare": [
                  "Rinse urad dal and fenugreek seeds in water for 2-3 times.",
                  " Soak urad dal, fenugreek seeds and poha (flattened rice) together in 1-cup water for 4-5 hours.",
                  " (Dal’s size and volume would increase to almost double after soaking ).",
                  "Rinse both parboiled and basmati rice together in water for 3-4 times.",
                  " (Place both types of rice in a large bowl and fill it with water till ¾th height. Rub rice grains between your fingers; this will make water turn cloudy. Drain the water and repeat the process for 3-4 times to rinse them properly ).",
                  " Soak them together in 2-cups of water for around 4-5 hours.Drain excess water from soaked urad dal and reserve it to use in grinding process in next step.",
                  " Transfer drained dal and fenugreek seeds into large jar of mixer grinder or wet grinder."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Idli" }]
              },
              {
                "name": "Methi Paratha",
                "items": [
                  "1 cup Whole Wheat Flour + 1/2 cup for dusting",
                  "1/4 cup Besan (gram flour), optional",
                  "1 cup Fenugreek Leaves (finely chopped)",
                  "1/2 teaspoon Cumin Seeds",
                  "1½ teaspoons Green Chilli-Ginger Paste (1 green chilli + ½ inch ginger), optional",
                  "1 teaspoon Red Chilli Powder",
                  "2 tablespoons Curd",
                  "1 tablespoon Oil + for shallow frying",
                  "Salt to taste"
                ],
                "waysToPrepare": [
                  "Pluck methi leaves (fenugreek leaves) from stems.",
                  "Add plucked leaves in a bowl filled with water and keep them soaked for approx. 2-3 minutes to dissolve and separate any dirt/debri. Remove the leaves from the water and repeat the process 2-3 times or more (as needed) to clean methi leaves. Finely chop cleaned green methi leaves.",
                  "Sift 1-cup whole wheat flour and gram flour in a wide mouth large bowl. Add cumin seeds, green chili-ginger paste, red chilli powder, curd, 1-tablespoon oil, finely chopped methi leaves and salt.and mix well.",
                  "Add water as needed to knead a smooth and soft dough like chapati. Cover the dough with a cloth or a plate and keep it aside for 15-20 minutes.",
                  "Knead the dough again. Divide it into 7-8 equal portions. Take each portion one by one, give it a round shape like ball and press it between your palms to give a pattie like shape."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Parota" }]
              }
            ]
          },
          {
            "name": "Lunch",
            "data": [
              {
                "name": "Tomato Rasam",
                "items": ["lemon", "tarmarind", "tomato"],
                "waysToPrepare": [
                  "Rasam is a light South Indian soup made with basic spices, tomatoes, tamarind and herbs.",
                  " It is very soothing to the tummy and helps in digestion. Rasam is served with rice but can also be enjoyed as a soup.",
                  " Add ¼ teaspoon methi seeds and 1 dried red chilli to a small pan and begin to dry roast them on a low to medium heat."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Rasam" }]
              },
              {
                "name": "Vegetable Palya",
                "items": [
                  "250 gms Cluster Beans",
                  "1 medium Potato, peeled and cut into cubes",
                  "1 small Tomato, chopped",
                  " 2 tablespoons Oil",
                  "1/4 teaspoon Mustard Seeds",
                  "1/2 teaspoon Cumin Seeds",
                  "1 teaspoon Ginger-Garlic Paste",
                  "A pinch of Asafoetida",
                  "1/4 teaspoon Turmeric Powder",
                  "1/2 teaspoon Red Chilli Powder",
                  "Salt to taste",
                  "1/2 cup Water",
                  "1 teaspoon Cumin-Coriander Powder"
                ],
                "waysToPrepare": [
                  "Karnataka Style Badanekayi Palya Recipe is a side dish prepared by sauteing the long brinjal with spicy ground coconut mixture.",
                  " The red color in the dish is mainly obtained from the use of Byadgi Dried Chillies which is a type dried red chili famous in Karnataka."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Palya" }]
              }
            ]
          },
          {
            "name": "Dinner",
            "data": [
              {
                "name": "Kerala Parotta",
                "items": ["atta", "salt", "oil"],
                "waysToPrepare": [
                  "Plain paratha are popular recipe that can be served with pickle or any side veggie dish.",
                  " Saved! In a bowl take whole wheat flour, salt, oil. Add water in portions and begin to mix and knead the dough. Mix and then knead into a smooth, pliable, soft dough."
                ],
                "comments": [
                  { "name": "Vikas", "comment": "Fantastic Kerala Parota" }
                ]
              },
              {
                "name": "Cucumber Raita",
                "items": [
                  "½ Cucumber",
                  "1 cup Natural Yogurt (240b, full fat)",
                  "1 tablespoon Fresh Mint",
                  "addSalt",
                  "¼ teaspoon Ground Cumin",
                  "1 tablespoon Fresh Coriander Leaf (cilantro)",
                  "½ Hot Green Chilli (finely chopped)"
                ],
                "waysToPrepare": [
                  "This simple raita recipe for the classic Indian yogurt sauce is the perfect complement to starters, street food and curries. ",
                  "Refreshing and cooling with mint and cucumber, it can be mixed up in minutes. Perfect for balancing the hottest Indian dishes"
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Raita" }]
              }
            ]
          }
        ]
      }
    },
    {
      "country": "American",
      "data": {
        "meals": [
          {
            "name": "Breakfast",
            "data": []
          },
          {
            "name": "Lunch",
            "data": [
              {
                "name": "Protein Salad",
                "items": ["tomato", "chopped almonds", "spinach"],
                "waysToPrepare": [
                  "Centering your lunch on protein and deep green vegetables is the healthiest way to go. ",
                  "Fresh spinach, albacore tuna, chopped almonds, tomatoes and avocados with a low-calorie dressing is a delicious option to add to your lunch repertoire."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Salad" }]
              },
              {
                "name": "Summer rolls with peanut sauce",
                "items": ["shrimp", "carrot", "spinach", ""],
                "waysToPrepare": [
                  "Buy pre-cooked shrimp either from the freezer section or your fishmonger. Some seafood departments will steam shrimp for you.",
                  "Pick up shredded carrots from the produce section.",
                  "Skip the rice noodles — although they are traditional, the rolls will be just as good without them."
                ],
                "comments": [
                  { "name": "Vikas", "comment": "Fantastic Summer roll" }
                ]
              }
            ]
          },
          {
            "name": "Dinner",
            "data": [
              {
                "name": "Hot Dogs",
                "items": [
                  "mustard",
                  "ketchip",
                  "mayonnaise",
                  "onions",
                  "relish",
                  "cheese and chilli"
                ],
                "waysToPrepare": [
                  "It doesn't get more American than a basic hot dog, sandwiched between a sliced bun, topped with a squiggle of ketchup and mustard. ",
                  "The sausage was created in the late 1600's by John Geoghehner, a butcher from Germany.",
                  " They were popularised in Chicago in 1893.",
                  " Everyone's favourite hot dog is basically a cooked sausage which is traditionally grilled or steamed.",
                  " Garnish with mustard, ketchup, mayonnaise, onions, relish, cheese and chilli."
                ],
                "comments": [
                  { "name": "Vikas", "comment": "Fantastic Hot dog" }
                ]
              },
              {
                "name": "Loaded Vegetable Sandwich",
                "items": ["vegetables"],
                "waysToPrepare": [
                  "The beauty of this lunch selection is you can pack it full of just about any vegetable you desire.",
                  " For an even tastier alternative, consider grilling vegetables at the beginning of the week with balsamic dressing so you can whip these little sandwiches up quickly any day of the week!"
                ],
                "comments": [
                  { "name": "Vikas", "comment": "Fantastic Sandwich" }
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "country": "Mexican",
      "data": {
        "meals": [
          {
            "name": "Breakfast",
            "data": []
          },
          {
            "name": "Lunch",
            "data": [
              {
                "name": "Chicken burrito bowl with rice and beans",
                "items": ["flour", "corn tortilla", "chicken"],
                "waysToPrepare": [
                  "Nothing is more delicious than Mexican food. Unfortunately the fried flour or corn tortillas can add unnecessary calories to your lunch.",
                  " So what’s a salsa lover to do? Remove the fried tortilla bowl and layer the ingredients just like you would on a tostada.",
                  " If you want to cheat a little, sprinkle crushed tortilla strips over the top."
                ],
                "comments": [
                  { "name": "Vikas", "comment": "Fantastic Burriot" }
                ]
              },
              {
                "name": "Chicken Tikka Burger",
                "items": [
                  "4 Boneless chicken breasts cut into ½ inch cubes ",
                  "4 Burger bunsSalt to taste",
                  "1 tsp Kashmiri red chilli powder",
                  "1 tbsp Lemon",
                  "3 tbsp Hung yogurt",
                  "1 tbsp Garlic paste1 tbsp Ginger paste",
                  "1/2 tsp Garam masala powder 1 tsp Mustard oil1 medium OnionButter as required",
                  "Mayonnaise2 tbsp Green chutney",
                  "1 tbsp OilLettuce leaves a few",
                  "corn tortilla"
                ],
                "waysToPrepare": [
                  "Place chicken cubes in a bowl, add salt, ½ tsp Kashmiri red chilli powder and juice of ½ lemon and mix well.",
                  "Set aside in a refrigerator to marinate for 15 minutes.",
                  "Mix together hung yogurt, garlic paste, ginger paste, salt, ½ teaspoon Kashmiri red chilli powder, garam masala powder and mustard oil in a bowl.",
                  "Add chicken and mix well. Set aside in the refrigerator to marinate for 3-4 hours. Halve the burger buns horizontally. Cut onion into thick roundels.",
                  "Put some butter on a heated griller and place the onion roundels on it and grill till lightly browned.",
                  "Mix together mayonnaise and green chutney in a small bowl. Remove onion from the griller and place in a bowl.",
                  "Arrange chicken pieces on the griller, drizzle a little oil and cook till the chicken is cooked and golden.",
                  "Apply mayonnaise-green chutney over all the burger halves.",
                  "Tear a few lettuce leaves and place over the bottom halves.",
                  "Arrange the chicken tikkas over the lettuce and place the onion roundels over them.11.Cover with the top halves of the burgers and press lightly. Serve immediately."
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Burger" }]
              }
            ]
          },
          {
            "name": "Dinner",
            "data": [
              {
                "name": "Mexican Chicken Nachos",
                "items": [
                  "1kg boneless and skinless chicken",
                  "1 green 1 yellow and 1 red pepper",
                  "1 cooked black beans",
                  "1 large red onion"
                ],
                "waysToPrepare": [
                  "Massage all the ingredients mentioned under marination list with the chicken.",
                  "Take 12 inches pan and put some oil and heat it up.",
                  "Add the marinated boneless chicken and cook it without closing the lid.",
                  "Let the juices from the chicken ooze out after 10 minutes of cooking and keep stirring the chicken occasionally so it doesn’t burn",
                  "Chicken should be ready within 30 min.utes of cooking.",
                  "Taste the salt and add accordingly towards the end if needed"
                ],
                "comments": [{ "name": "Vikas", "comment": "Fantastic Nachos" }]
              }
            ]
          }
        ]
      }
    }
  ]
}
